export const regionsWithCities = {
  'Вінницька область': [
    'Вінниця', 'Бар', 'Бершадь', 'Гайсин', 'Жмеринка', 'Іллінці', 'Калинівка', 'Козятин', 'Ладижин', 'Могилів-Подільський',
    'Немирів', 'Погребище', 'Тульчин', 'Хмільник', 'Шаргород', 'Ямпіль'
  ],
  'Волинська область': [
    'Луцьк', 'Берестечко', 'Володимир', 'Горохів', 'Камінь-Каширський', 'Ківерці', 'Ковель', 'Локачі', 'Любомль', 'Нововолинськ',
    'Ратне', 'Рожище', 'Старий Чорторийськ', 'Турійськ', 'Устилуг'
  ],
  'Дніпропетровська область': [
    'Дніпро', 'Апостолове', 'Верхівцеве', 'Верхньодніпровськ', 'Вільногірськ', 'Жовті Води', 'Кам\'янське', 'Кривий Ріг',
    'Марганець', 'Нікополь', 'Новомосковськ', 'Орджонікідзе', 'Павлоград', 'Перещепине', 'Першотравенськ', 'П\'ятихатки',
    'Синельникове', 'Тернівка', 'Васильківка'
  ],
  'Донецька область': [
    'Донецьк', 'Авдіївка', 'Амвросіївка', 'Артемівськ', 'Бахмут', 'Білозерське', 'Вугледар', 'Горлівка', 'Дебальцеве',
    'Димитров', 'Добропілля', 'Докучаєвськ', 'Дружківка', 'Єнакієве', 'Жданівка', 'Зугрес', 'Костянтинівка', 'Краматорськ',
    'Красногорівка', 'Красноармійськ', 'Лиман', 'Маріуполь', 'Макіївка', 'Новогродівка', 'Селидове', 'Слов\'янськ',
    'Сніжне', 'Соледар', 'Торез', 'Харцизьк', 'Часів Яр', 'Шахтарськ', 'Ясинувата'
  ],
  'Житомирська область': [
    'Житомир', 'Андрушівка', 'Баранівка', 'Бердичів', 'Коростень', 'Коростишів', 'Малин', 'Новоград-Волинський', 'Овруч',
    'Радомишль', 'Чуднів'
  ],
  'Закарпатська область': [
    'Ужгород', 'Берегово', 'Виноградів', 'Іршава', 'Мукачево', 'Перечин', 'Рахів', 'Свалява', 'Тячів', 'Хуст', 'Чоп'
  ],
  'Запорізька область': [
    'Запоріжжя', 'Бердянськ', 'Василівка', 'Дніпрорудне', 'Енергодар', 'Мелітополь', 'Молочанськ', 'Оріхів', 'Пологи',
    'Приморськ', 'Токмак'
  ],
  'Івано-Франківська область': [
    'Івано-Франківськ', 'Болехів', 'Бурштин', 'Галич', 'Городенка', 'Долина', 'Коломия', 'Косів', 'Калуш', 'Надвірна',
    'Рогатин', 'Снятин', 'Тисмениця', 'Тлумач', 'Яремче'
  ],
  'Київська область': [
    'Київ', 'Біла Церква', 'Бориспіль', 'Бровари', 'Буча', 'Васильків', 'Вишгород', 'Ірпінь', 'Кагарлик', 'Обухів', 'Переяслав',
    'Сквира', 'Славутич', 'Тараща', 'Тетіїв', 'Українка', 'Фастів', 'Яготин'
  ],
  'Кіровоградська область': [
    'Кропивницький', 'Бобринець', 'Гайворон', 'Долинська', 'Знам\'янка', 'Мала Виска', 'Новомиргород', 'Новоукраїнка',
    'Олександрія', 'Світловодськ'
  ],
  'Луганська область': [
    'Луганськ', 'Алчевськ', 'Антрацит', 'Брянка', 'Голубівка', 'Кадіївка', 'Лисичанськ', 'Первомайськ', 'Ровеньки', 'Рубіжне',
    'Сватове', 'Сєвєродонецьк', 'Сорокине', 'Старобільськ'
  ],
  'Львівська область': [
    'Львів', 'Борислав', 'Броди', 'Буськ', 'Дрогобич', 'Золочів', 'Кам\'янка-Бузька', 'Миколаїв', 'Моршин', 'Новий Розділ',
    'Новояворівськ', 'Перемишляни', 'Пустомити', 'Радехів', 'Самбір', 'Сколе', 'Сокаль', 'Стебник', 'Стрий', 'Трускавець',
    'Червоноград', 'Яворів'
  ],
  'Миколаївська область': [
    'Миколаїв', 'Баштанка', 'Вознесенськ', 'Нова Одеса', 'Новий Буг', 'Очаків', 'Первомайськ', 'Снігурівка', 'Южноукраїнськ'
  ],
  'Одеська область': [
    'Одеса', 'Ананьїв', 'Арциз', 'Балта', 'Білгород-Дністровський', 'Болград', 'Ізмаїл', 'Іллічівськ', 'Кілія', 'Кодима',
    'Любашівка', 'Рені', 'Роздільна', 'Татарбунари', 'Теплодар', 'Чорноморськ', 'Южне'
  ],
  'Полтавська область': [
    'Полтава', 'Гадяч', 'Глобине', 'Горішні Плавні', 'Гребінка', 'Карлівка', 'Кобеляки', 'Кременчук', 'Лохвиця',
    'Лубни', 'Миргород', 'Пирятин', 'Хорол', 'Червонозаводське'
  ],
  'Рівненська область': [
    'Рівне', 'Березне', 'Вараш', 'Дубно', 'Дубровиця', 'Здолбунів', 'Корець', 'Костопіль', 'Острог', 'Радивилів', 'Сарни'
  ],
  'Сумська область': [
    'Суми', 'Білопілля', 'Буринь', 'Глухів', 'Конотоп', 'Лебедин', 'Охтирка', 'Путивль', 'Ромни', 'Свеса', 'Шостка',
    'Тростянець'
  ],
  'Тернопільська область': [
    'Тернопіль', 'Бережани', 'Борщів', 'Бучач', 'Заліщики', 'Збараж', 'Зборів', 'Кременець', 'Ланівці', 'Монастириська',
    'Підволочиськ', 'Підгайці', 'Теребовля', 'Чортків', 'Шумськ'
  ],
  'Харківська область': [
    'Харків', 'Балаклія', 'Барвінкове', 'Богодухів', 'Валки', 'Вовчанськ', 'Дергачі', 'Ізюм', 'Красноград', 'Куп\'янськ',
    'Лозова', 'Люботин', 'Мерефа', 'Первомайський', 'Чугуїв', 'Шевченкове'
  ],
  'Херсонська область': [
    'Херсон', 'Берислав', 'Великоолександрівка', 'Гола Пристань', 'Каховка', 'Нова Каховка', 'Нова Одеса', 'Скадовськ',
    'Цюрупинськ'
  ],
  'Хмельницька область': [
    'Хмельницький', 'Бережани', 'Деражня', 'Кам\'янець-Подільський', 'Копичинці', 'Нетішин', 'Понінка', 'Проскурів', 'Славута',
    'Шепетівка'
  ],
  'Черкаська область': [
    'Черкаси', 'Богуслав', 'Ватутіне', 'Золотоноша', 'Умань', 'Черкаси', 'Черкаська', 'Черкаська область', 'Шпола'
  ],
  'Чернівецька область': [
    'Чернівці', 'Вижниця', 'Герца', 'Кіцмань', 'Новодністровськ', 'Сокиряни', 'Сторожинець', 'Хотин'
  ],
  'Чернігівська область': [
    'Чернігів', 'Бахмач', 'Березна', 'Городня', 'Корюківка', 'Мена', 'Ніжин', 'Носівка', 'Прилуки', 'Седнів', 'Щорс'
  ]
};
