import MainHeader from "../../modules/main-page/components/ui/MainHeader.tsx";
import Footer from "../../components/Footer.tsx";
import Wrapper from "../../ui/Wrapper.tsx";
import { useState } from "react";
import DownArrow from '../../assets/images/Down_Arrow.svg?react';
import {Helmet} from "react-helmet-async";

const questionsSection1 = [
	{ question: "Що таке Synara?", answer: "Synara - це онлайн-платформа, створена для об'єднання людей, які постраждали від війни в Україні, з тими, хто готовий надати їм допомогу. Це місце, де можна знайти підтримку, ресурси та волонтерів, які допоможуть подолати труднощі та відновити своє життя." },
	{ question: "Яка мета платформи?", answer: "Метою платформи є надання комплексної допомоги людям, які постраждали від війни, шляхом створення зручного та ефективного інструменту для пошуку та надання допомоги. Ми прагнемо забезпечити доступ до різних видів підтримки, включаючи гуманітарну, психологічну, юридичну та інформаційну допомогу, а також сприяти відновленню соціальних зв'язків та інтеграції у нове середовище." },
	{ question: "Хто може користуватися платформою?", answer: "Платформа призначена для всіх, хто постраждав від війни в Україні, незалежно від віку, статі, соціального статусу чи місця проживання. Також ми запрошуємо волонтерів, які готові надати свою допомогу та підтримку, а також організації, які працюють у сфері допомоги постраждалим від війни." },
	{ question: "Як зареєструватися на платформі?", answer: "Щоб зареєструватися на платформі, натисніть кнопку \"Зареєструватися\" на головній сторінці. Виберіть свою роль (потерпілий або волонтер) та заповніть реєстраційну форму, вказавши необхідну інформацію. Після успішної реєстрації ви отримаєте доступ до всіх функцій платформи та зможете створювати запити на допомогу або пропонувати свою підтримку іншим." }
];

const questionsSection2 = [
	{ question: "Як створити запит на допомогу?", answer: "Щоб створити запит на допомогу, увійдіть у свій обліковий запис та перейдіть до розділу \"Потрібна допомога\". Натисніть кнопку \"Створити запит\", оберіть потрібну категорію допомоги та заповніть форму, детально описавши свої потреби. Не забудьте вказати контактну інформацію, щоб волонтери могли з вами зв'язатися." },
	{ question: "Які види допомоги можна отримати на платформі?", answer: "Наша платформа пропонує різноманітні види допомоги, включаючи:\n" +
			"Гуманітарну допомогу: продукти харчування, одяг, засоби гігієни, медикаменти тощо.\n" +
			"Психологічну допомогу: консультації психологів, групи підтримки, допомога у подоланні стресу та травми.\n" +
			"Юридичну допомогу: консультації юристів, допомога з оформленням документів, захист прав.\n" +
			"Інформаційну допомогу: актуальна та перевірена інформація про ваші права, доступні ресурси та послуги.\n" +
			"Матеріальну допомогу: фінансова підтримка, допомога з пошуком роботи, тимчасове житло." },
	{ question: "Як знайти волонтера?", answer: "Ви можете знайти волонтера, який відповідає вашим потребам, скориставшись пошуком на платформі. Вкажіть потрібну категорію допомоги, ваше місцезнаходження та інші критерії, і система підбере для вас відповідних волонтерів. Ви також можете переглядати оголошення волонтерів, які пропонують свою допомогу, та зв'язатися з ними безпосередньо через платформу." },
	{ question: "Як забезпечується моя безпека на платформі?", answer: "Ми дуже серйозно ставимося до безпеки наших користувачів. Ми вживаємо всіх необхідних заходів для захисту ваших персональних даних та забезпечення безпечного спілкування на платформі. Всі волонтери проходять перевірку, а їхні профілі містять відгуки від інших користувачів. Крім того, ми маємо систему модерації контенту та можливість повідомляти про підозрілу активність." },
	{ question: "Як спілкуватися з волонтерами?", answer: "Зв'язок з волонтерами відбувається безпосередньо на платформі після того, як вони відгукнуться на ваш запит або ви самі їх знайдете. Ви можете обрати зручний для вас спосіб комунікації: текстовий чат для обміну повідомленнями в режимі реального часу або голосовий чат для безпосереднього спілкування та отримання підтримки." },
];

const questionsSection3 = [
	{ question: "Як стати волонтером на платформі?", answer: "Щоб стати волонтером, натисніть кнопку \"Зареєструватися\" на головній сторінці та оберіть роль \"Волонтер\". Заповніть реєстраційну форму, вказавши свої контактні дані, навички та досвід, а також види допомоги, які ви готові надавати. Після успішної реєстрації ви отримаєте доступ до розділу для волонтерів." },
	{ question: "Як знайти оголошення про допомогу?", answer: "Перейдіть до розділу \"Пошук оголошень\" та скористайтеся фільтрами, щоб знайти запити на допомогу, які відповідають вашим можливостям та інтересам. Ви можете фільтрувати оголошення за категорією допомоги, місцезнаходженням потерпілого, терміновістю тощо." },
	{ question: "Як запропонувати свою допомогу?", answer: "Відкрийте оголошення, яке вас зацікавило, та натисніть кнопку \"Детальніше\". Вкажіть, яку саме допомогу ви готові надати, та залиште коротке повідомлення для потерпілого. Після цього ви зможете зв'язатися з ним через платформу та обговорити деталі." },
	{ question: "Як отримати відзнаку або сертифікат?", answer: "Відзнаки та сертифікати надаються волонтерам за активну участь у допомозі та високу якість наданих послуг. Критерії для отримання відзнак можуть включати кількість виконаних запитів, позитивні відгуки від потерпілих, участь у спеціальних проектах тощо. Інформацію про отримані відзнаки та сертифікати ви зможете знайти у своєму профілі." },
	{ question: "Як отримати підтримку, якщо виникнуть труднощі під час волонтерства?", answer: "Звернення до служби підтримки: Ви завжди можете звернутися до нашої служби підтримки через чат на платформі або за електронною поштою. Ми оперативно відповімо на ваші запитання та допоможемо вирішити будь-які проблеми." }
];

const questionsSection4 = [
	{ question: "Як змінити пароль?", answer: "Щоб змінити пароль, спочатку увійдіть у свій обліковий запис. Потім перейдіть до розділу \"Налаштування\" або \"Мій профіль\". Там ви знайдете опцію \"Змінити пароль\". Натисніть на неї, введіть свій поточний пароль, а потім двічі новий пароль. Завершіть процес, натиснувши кнопку \"Зберегти\" або \"Змінити пароль\"." },
	{ question: "Як відновити доступ до облікового запису?", answer: "Якщо ви забули пароль і не можете увійти до свого облікового запису, не хвилюйтеся. На сторінці входу знайдіть посилання \"Забули пароль?\" або \"Відновити доступ\" та натисніть на нього. Введіть адресу електронної пошти, яку ви використовували під час реєстрації, і ми надішлемо вам листа з інструкціями щодо відновлення паролю. Просто перейдіть за посиланням у листі та створіть новий пароль." },
	{ question: "Як видалити свій обліковий запис?", answer: "Якщо ви вирішили видалити свій обліковий запис, увійдіть до нього та перейдіть до розділу \"Налаштування\" або \"Мій профіль\". Там ви знайдете опцію \"Видалити обліковий запис\". Натисніть на неї та підтвердіть видалення. Пам'ятайте, що видалення облікового запису є незворотнім, і всі ваші дані будуть видалені з платформи." },
	{ question: "Що робити, якщо виникли технічні проблеми з платформою?", answer: "Якщо у вас виникли технічні проблеми під час користування платформою, спробуйте спочатку перезавантажити сторінку або очистити кеш браузера. Також переконайтеся, що у вас стабільне інтернет-з'єднання. Якщо проблема не зникає, спробуйте використати інший браузер або пристрій. Якщо ці дії не допомогли, зверніться до нашої служби підтримки, описавши проблему якомога детальніше. Ми докладемо всіх зусиль, щоб допомогти вам вирішити її якомога швидше." },
];

// @ts-ignore
const AccordionItem = ({ question, answer }) => {
	const [isOpen, setIsOpen] = useState(false);

	return (
		<div className="border border-gray-300 px-2 mb-1 rounded-lg">
			<button
				className="w-full text-left py-4 flex justify-between items-center focus:outline-none"
				onClick={() => setIsOpen(!isOpen)}
			>
				<span className="font-montserratRegular">{question}</span>
				<span>{isOpen ? <DownArrow className="rotate-180  mr-2 w-3 h-3"/> : <DownArrow className=" mr-2 w-3 h-3"/>}</span>
			</button>
			{isOpen && <p className="font-montserratRegular pb-4">{answer}</p>}
		</div>
	);
};

const FAQPage = () => {
	return (
		<Wrapper>
			<Helmet>
				<title>Найчастіші запитання - Synara</title>
				<meta name="description" content="Знайдіть відповіді на найчастіші запитання про платформу Synara, її функції та можливості." />
				<meta name="keywords" content="FAQ, запитання, Synara, українці, допомога" />
				<meta name="robots" content="index, follow" />
				<link rel="canonical" href="https://synara.help/faq" />
			</Helmet>
			<MainHeader />
			<div className="min-h-screen mt-20 ml-[3%] mr-[3%]">
				<h1 className="text-h3 font-kharkiv uppercase">Найчастіші запитання</h1>
				<h2 className="text-h5 font-kharkiv mt-8">Загальні питання про платформу:</h2>

				{/* Section 1 */}
				<div className="mt-8">
					{questionsSection1.map((q, index) => (
						<AccordionItem key={index} question={q.question} answer={q.answer} />
					))}
				</div>

				{/* Section 2 */}
				<h2 className="text-h5 font-kharkiv mt-12">Питання для потерпілих:</h2>
				<div className="mt-8">
					{questionsSection2.map((q, index) => (
						<AccordionItem key={index} question={q.question} answer={q.answer} />
					))}
				</div>

				{/* Section 3 */}
				<h2 className="text-h5 font-kharkiv mt-12">Питання для волонтерів:</h2>
				<div className="mt-8">
					{questionsSection3.map((q, index) => (
						<AccordionItem key={index} question={q.question} answer={q.answer} />
					))}
				</div>

				{/* Section 4 */}
				<h2 className="text-h5 font-kharkiv mt-12">Технічні питання:</h2>
				<div className="mt-8">
					{questionsSection4.map((q, index) => (
						<AccordionItem key={index} question={q.question} answer={q.answer} />
					))}
				</div>
			</div>
			<Footer />
		</Wrapper>
	);
};

export default FAQPage;
